<?php

return [
    'blog_first_pass' => "Γράψτε ένα άρθρο ιστολογίου, χρησιμοποιώντας μία :tone τονικότητα, χρησιμοποιώντας τις ετικέτες <p> για να περιβάλλετε παραγράφους, τις ετικέτες <h2> για να περιβάλλετε κύρια θέματα και τις ετικέτες <h3> για να περιβάλλετε εσωτερικά θέματα, βασισμένο στο παρακάτω περίγραμμα: \n\n:outline\n\n\nΠεραιτέρω οδηγίες: Μην περιβάλλετε τις ετικέτες h2 και h3 με ετικέτες p, για παράδειγμα: \n\n Κακή έξοδος:\n<p><h2>Θέμα</h2></p>\n\nΚακή έξοδος:\n<p><h2>Θέμα</h2><h3>Εσωτερικό θέμα</h3></p>\n\n\nΗ δομή του περιγράμματος πρέπει να αναλυθεί σε ετικέτες html όπως εξής:\n\nΕίσοδος:\nA. Θέμα 1\n\nΈξοδος:<h3>A. Θέμα 1</h3>\n\nΕίσοδος:\nB. Θέμα 2\n\nΈξοδος:<h3>B. Θέμα 2</h3>",
    'expand_text' => "Χρησιμοποιώντας μία :tone τονικότητα, και χρησιμοποιώντας τις ετικέτες <h3> για υποθέματα και τις ετικέτες <p> για παραγράφους, επεκτείνετε στο: \n\n:context\n\n\nΠεραιτέρω οδηγίες:\n-Όταν επεκτείνετε το κείμενο, μην δημιουργείτε νέα <h3> εσωτερικά θέματα. Αντ 'αυτού, αυξήστε τον αριθμό των παραγράφων.",
    'given_following_text' => "Δεδομένου του ακόλουθου κειμένου:\n\n:text",
    'given_following_context' => "Και δεδομένου του ακόλουθου πλαισίου:\n\n:context\n\n\n",
    'keyword_instructions' => "- Χρησιμοποιήστε τη λέξη-κλειδί \":keyword\".\n",
    'more_instructions' => "- Ακολουθήστε αυτές τις άλλες οδηγίες για τη δημιουργία της δημοσίευσης:\n\n\n :instructions\n\n\n",
    'meta_description_context_instructions' => "- Η περιγραφή μεταδεδομένων πρέπει να βασίζεται στο εξής πλαίσιο:\n\n\n :context\n\n\n",
    'post_context_instructions' => "- Η δημοσίευση πρέπει να βασίζεται στο εξής πλαίσιο:\n\n\n :context\n\n\n",
    'post_tone_instructions' => "- Η δημοσίευση πρέπει να έχει έναν :tone τόνο.\n",
    'simplify_text' => "Απλοποιήστε το εξής κείμενο:\n\n:text",
    'summarize_text' => "Περιλάβετε το εξής κείμενο:\n\n :text",
    'write_meta_description' => "Γράψτε μια περιγραφή μεταδεδομένων με μέγιστο 20 λέξεις. Χρησιμοποιήστε τις παρακάτω οδηγίες για να καθοδηγήσετε τη συγγραφή σας:\n\n",
    'write_outline' => "Δημιουργήστε μια εμπεριστατωμένη και περιεκτική περίγραμμα δημοσίευσης σε ιστολόγιο, με μέγιστο δύο επίπεδα, χρησιμοποιώντας ρωμαϊκούς αριθμούς που υποδεικνύουν κύρια θέματα και αλφαβητικά γράμματα για να υποδεικνύουν υποθέματα. Το περίγραμμα πρέπει να έχει μόνο :maxsubtopics θέματα. Το περίγραμμα πρέπει να έχει έναν :tone τόνο. Το περίγραμμα πρέπει να έχει ένα καταληκτικό θέμα στο τέλος. Μην ενθέτετε ένα τρίτο επίπεδο θεμάτων. Μην προσθέτετε εσωτερικά θέματα μέσα στα υποθέματα που υποδεικνύονται από αλφαβητικά γράμματα, για παράδειγμα: \n\nΚαλή έξοδος:\nI. Κύριο θέμα \n A. Υποθέμα 1 \n B. Υποθέμα 2 \n C. Υποθέμα 3 \n\nΚακή έξοδος:\nI. Κύριο θέμα \nA. Υποθέμα 1 \nB. Υποθέμα 2\n   1. Εσωτερικό θέμα 1\n   2. Εσωτερικό θέμα 2\nC. Υποθέμα 3\n\n\n Το περίγραμμα πρέπει να βασίζεται στο εξής κείμενο: \n\n:context",
    'write_social_media_post' => "Γράψτε μια δημοσίευση στα κοινωνικά μέσα για :platform. Χρησιμοποιήστε τις παρακάτω οδηγίες για να καθοδηγήσετε τη συγγραφή σας:\n\n",
    'write_title' => "Γράψτε έναν τίτλο, με μέγιστο 7 λέξεις, για το εξής κείμενο: \n\n:context\n\n\nΠαραδείγματα καλών και κακών εξόδων:\n\nΚακή έξοδος:\nΤίτλος: Αυτός είναι ο τίτλος\n\nΚαλή έξοδος:\nΑυτός είναι ο τίτλος\n\nΠεραιτέρω οδηγίες:\n\n- Ο τίτλος πρέπει να έχει έναν :tone τόνο.\n",
];
