<?php

return [
    'blog_first_pass' => "اكتب مقالة مدونة بلهجة :tone ، باستخدام الوسوم <p> لتمييز الفقرات، الوسوم <h2> لتمييز المواضيع الرئيسية، والوسوم <h3> لتمييز المواضيع الداخلية، استنادًا إلى الخطة التالية: \n\n:outline\n\n\nتعليمات إضافية: لا تحيط الوسوم h2 و h3 بوسوم p، على سبيل المثال: \n\nخروج سيء:\n<p><h2>موضوع</h2></p>\n\nخروج سيء:\n<p><h2>موضوع</h2><h3>موضوع داخلي</h3></p>\n\n\nيجب تحويل هيكل الخطة إلى وسوم html كالتالي:\n\nالإدخال:\nA. موضوع 1\n\nالإخراج:<h3>A. موضوع 1</h3>\n\nالإدخال:\nB. موضوع 2\n\nالإخراج:<h3>B. موضوع 2</h3>",
    'expand_text' => "استخدم لهجة :tone، واستخدم الوسوم <h3> لتمييز الفروع الفرعية، والوسوم <p> لتمييز الفقرات، لتوسيع النص التالي: \n\n:context\n\n\nتعليمات إضافية:\n- عند توسيع النص، لا تقم بإنشاء مواضيع داخلية <h3> جديدة. بدلاً من ذلك، قم بزيادة عدد الفقرات.",
    'given_following_text' => "تم إعطاء النص التالي:\n\n:text",
    'given_following_context' => "وتم إعطاء السياق التالي:\n\n:context\n\n\n",
    'keyword_instructions' => "- استخدم الكلمة الرئيسية \":keyword\".\n",
    'more_instructions' => "- اتبع التعليمات الإضافية لإنشاء المنشور:\n\n\n :instructions\n\n\n",
    'meta_description_context_instructions' => "- يجب أن تعتمد الوصف الوظيفي على السياق التالي:\n\n\n :context\n\n\n",
    'post_context_instructions' => "- يجب أن يعتمد المنشور على السياق التالي:\n\n\n :context\n\n\n",
    'post_tone_instructions' => "- يجب أن يكون لهجة المنشور :tone.\n",
    'simplify_text' => "بسط النص التالي:\n\n:text",
    'summarize_text' => "اختصر النص التالي:\n\n :text",
    'write_meta_description' => "اكتب وصفًا وظيفيًا لا يزيد عن 20 كلمة. استخدم الإرشادات التالية للكتابة:\n\n",
    'write_outline' => "أنشئ خطة تفصيلية شاملة لمقالة المدونة باستخدام الأرقام الرومانية لتمييز المواضيع الرئيسية، واستخدم الحروف لتمييز الفروع الفرعية. يجب أن تحتوي الخطة فقط على :maxsubtopics موضوع. يجب أن تكون لهجة الخطة :tone. يجب أن تحتوي الخطة على موضوع ختامي في النهاية. لا تدخل مواضيع من المستوى الثالث. على سبيل المثال، لا تضيف مواضيع داخلية ضمن فروع فرعية تم تمييزها بالحروف. مثال: \n\nخروج جيد:\nI. موضوع رئيسي \n A. فرع فرعي 1 \n B. فرع فرعي 2 \n C. فرع فرعي 3 \n\nخروج سيء:\nI. موضوع رئيسي \nA. فرع فرعي 1 \nB. فرع فرعي 2\n   1. موضوع داخلي 1\n   2. موضوع داخلي 2\nC. فرع فرعي 3\n\n\n يجب أن تعتمد الخطة على النص التالي: \n\n:context",
    'write_social_media_post' => "اكتب منشور للمواقع الاجتماعية على :platform. استخدم الإرشادات التالية للكتابة:\n\n",
    'write_title' => "اكتب عنوانًا لا يزيد عن 7 كلمات للنص التالي: \n\n:context\n\n\nأمثلة على الإخراج الجيد والسيء:\n\nالإخراج السيء:\nالعنوان: هذا هو العنوان\n\nالإخراج الجيد:\nهذا هو العنوان\n\nتعليمات إضافية:\n\n- يجب أن يكون لهجة العنوان :tone.\n",
];
